{
    "taskName": "Nodejs_basic Task5 Logging & error handling",
    "github": "https://github.com/rolling-scopes-school/basic-nodejs-2021Q2#task-5-logging--error-handling",
    "information": "<a href=\"https://github.com/rolling-scopes-school/basic-nodejs-2021Q2/blob/master/cross-check/typescript-basics.md#%D0%BF%D0%BE%D0%B4%D1%81%D0%BA%D0%B0%D0%B7%D0%BA%D0%B8\">Как увидеть различия</a> между папками <code>test</code> и <code>.github</code> между текущей веткой и веткой master из темплейта",
    "criteria": [
        {
            "type": "title",
            "title": "Реализация"
        },
        {
            "type": "subtask",
            "text": "Логирование (как минимум url, query parameters, body) для всех запросов к серверу, а также кода ответа (status code) осуществляется с использованием middleware",
            "max": 20
        },
        {
            "type": "subtask",
            "text": "Добавлена централизованная обработка всех ошибок, которая включает отправку респонса с соответствующим кодом http статуса и их логирование с использованием middleware",
            "max": 20
        },
        {
            "type": "subtask",
            "text": "Добавлены обработка и логирование ошибок на событие uncaughtException",
            "max": 10
        },
        {
            "type": "subtask",
            "text": "Добавлены обработка и логирование ошибок на событие unhandledRejection",
            "max": 10
        },
        {
            "type": "subtask",
            "text": "Процесс логирования осуществляется единственным модулем (т.е. код, осуществляющий логирование, находится в одном модуле, при этом этот модуль может использоваться внутри других модулей)",
            "max": 20
        },
        {
            "type": "subtask",
            "text": "Логи записываются в файл",
            "max": 20
        },
        {
            "type": "subtask",
            "text": "Логи ошибок записываются в отдельный файл (либо только в него, либо в дополнение к записи в общий файл)",
            "max": 10
        },
        {
            "type": "title",
            "title": "Штрафы"
        },
        {
            "type": "penalty",
            "text": "Наличие изменений в тестах либо в workflow",
            "max": -100
        },
        {
            "type": "penalty",
            "text": "Внесение изменений в репозиторий после дедлайна не считая коммиты, вносящие изменения только в <code>Readme.md</code> и другую документацию) минус 30% от максимального балла за задание (для этого задания 33 балла)",
            "max": -33
        },
        {
            "type": "penalty",
            "text": "За каждый непрошедший тест -10 баллов. Здесь только отметить, есть ли такие тесты, сумму штрафа посчитать вручную",
            "max": 0
        },
        {
            "type": "penalty",
            "text": "За каждую ошибку линтера при запуске npm run lint на основе локального конфига, равно как и за ошибки компиляции на основе локального tsconfig -10 баллов (именно errors, не warnings). Здесь только отметить, есть ли такие ошибки, сумму штрафа посчитать вручную",
            "max": 0
        },
        {
            "type": "penalty",
            "text": "Имеются явно указанные типы any, unknown -20 баллов за каждое использование. Здесь только отметить, есть ли такое использование, сумму штрафа посчитать вручную",
            "max": 0
        },
        {
            "type": "penalty",
            "text": "Отсутствует отдельная ветка для разработки",
            "max": -20
        },
        {
            "type": "penalty",
            "text": "Отсутствует Pull Request",
            "max": -20
        },
        {
            "type": "penalty",
            "text": "Неполная информация в описании Pull Request (отсутствует либо некорректен один из 3 обязательных пунктов). NB! Не учитываем отсутствие в описании штрафа за непрошедший тест или штрафа за ошибки компиляции",
            "max": -10
        },
        {
            "type": "penalty",
            "text": "Меньше 3 коммитов в ветке разработки, не считая коммиты, вносящие изменения только в Readme.md",
            "max": -20
        }
    ]
}